# GetMinSymbolWidth Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFCUtils..::..GetMinSymbolWidth Method
ExporterIFCUtils Class See Also
---
Obtains the minimum width of the given FamilySymbol.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static double GetMinSymbolWidth(
	FamilySymbol symbol
)
```

Visual Basic
---
```text
Public Shared Function GetMinSymbolWidth ( _
	symbol As FamilySymbol _
) As Double
```

Visual C++
---
```text
public:
static double GetMinSymbolWidth(
	FamilySymbol^ symbol
)
```

# ### Parameters
symbol
    Type: Autodesk.Revit.DB..::..FamilySymbol The family symbol.
# ### Return Value
The minimum width.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace